brew "antigen"
brew "asciinema"
brew "awscli"
brew "bat"
brew "cloudflared"
brew "colima"
brew "docker"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "glab"
brew "gnupg"
brew "go"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "kube-ps1"
brew "kubectx"
brew "kubent"
brew "qemu"
brew "lima-additional-guestagents"
brew "mise"
brew "neovim"
brew "nmap"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "openjdk@17"
brew "openssh"
brew "pcsc-lite"
brew "pinentry-mac"
brew "podman"
brew "ripgrep"
brew "stow"
brew "tfenv"
brew "thefuck"
brew "tlrc"
brew "tree"
brew "wget"
brew "ykman"
brew "yq"
brew "yubikey-agent"
brew "zellij"
brew "zsh"
cask "bettertouchtool", args: { appdir: "~/Applications" }
cask "ghostty"
cask "iterm2"
cask "kiro-cli"
cask "utm"
cask "visual-studio-code"
vscode "alefragnani.bookmarks"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "continue.continue"
vscode "docker.docker"
vscode "github.remotehub"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "johnpapa.vscode-peacock"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.remote-wsl-recommender"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "redhat.vscode-yaml"
vscode "vscode-icons-team.vscode-icons"
vscode "zainchen.json"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
